{
    "title":"Farger",
    "category": "navigation",
    "importance": 2,
    "preface": "Det er mange retningslinjer om hva som er god UX når man lager skjema. De viktigste tingene man må tenke på er hvordan man håndterer valideringer og feilmeldinger, hvordan man navngir elementer i skjema og rekkefølgen, og mellomlagring. I tillegg er det viktig å følge retningslinjer for tekst, farger, kontraster og illustrasjoner som ved annet innhold.",
    "figure": "/images/farger-2x.png",
    "figureBackgroundColor": "#272727",
    "body": "<p>Loven tilsier at du ikke skal bruke kun farge for å signalisere en status. Det er lett å tenke at “blå tekst med understrek på hover”  løser utfordringen, men merk deg at lovverket gir mye større rom for kreativitet (såfremt det ikke er i løpende tekst) I tillegg til fargebruk kan man i tillegg benytte tekst, bilder, ikoner osv. Dette fungerer godt for brukere med nomalt syn, men ikke så bra for svaksynte eller blinde som har egne verktøy for å oppfatte løsningen. For disse segmentene/målgruppene/ brukerne fremhever man funksjonalitet gjennom kode. </p><p>I WCAG 2.0 under prinsipp 1 Mulig å oppfatte, er det en egen retningslinje som handler om å tilrettelegge for brukerne slik at de kan skille forgrunn fra bakgrunn - retningslinje 1.4. Innenfor retningslinjen er det særlig to suksesskriterier som er gjeldende ift. bruk av farger, suksesskriterie 1.4.1 Bruk av farger og suksesskriterie 1.4.3 Kontrast - minimumskrav</p><p>Både retningslinje og suksesskriterier kan testes på mange måter, et enkelt program er Colour contrast analyser (lenke under)</p><p>Ellers har DIFI har en veldig god gjennomgang av kontrast i sin UU-skole, enkelt og greit både rundt kravene og hvordan man faktisk sjekker kontrast</p>",
    "reference": [{
        "url": "http://contrastchecker.com/",
        "title": "Contrast Checker"
    }, {
        "url": "http://webdesignerschecklist.com/",
        "title": "Web designers check list"
    }, {
        "url": "http://www.paciellogroup.com/resources/contrastanalyser/",
        "title": "Forståelse av retningslinje 1.4 “Mulig å skille fra hverandre” kan leses mer om her"
    }, {
        "url": "http://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast.html",
        "title": "Inndata"
    }, {
        "url": "http://www.w3.org/WAI/WCAG20/quickref/#qr-visual-audio-contrast-without-color",
        "title": "Suksesskriterie 1.4.1 Bruk av farger"
    }, {
        "url": "http://www.w3.org/WAI/WCAG20/quickref/#qr-visual-audio-contrast-contrast",
        "title": "Suksesskriterie 1.4.3 Kontrast - minimumskrav"
    }],
    "relevant": [{
        "url": "http://uu.difi.no/veiledning/nettsider/uu-skolen/kontrast",
        "title": "Difis UU-skole"
    }]
}

