{
    "title":"Skjemaer",
    "preface": "Det er mange retningslinjer om hva som er god UX når man lager skjemaer. Her fokuserer vi på hva som er viktig å tenke over ved skjemadesign ifht universell utforming.",
    "figure": "http://placekitten.com/1020/400",
    "body": "<h2>Feilmeldinger</h2><p>Det er viktig at feilmeldinger kommer tett på inputfeltet, slik at svaksynte med forstørret skjerm raskt ser hvor feilen ble gjort. En feilmelding som ligger et stykke unna fra der feilen ble gjort, vil ikke være synlig for en som har forstørret skjermen. Feilmeldinger bør ikke ligge inne i inputfeltet ved feks fargekode, en fargeblind kan ha utfordringer med å oppfatte feilemeldingen. For en dyslektiker er det derimot bra å få fargekode, det gir en rask visuell oversikt. Det er derfor fordelaktig at felmeldinger kommer i både farge og tekst, tett knyttet til feltet det gjelder. Norsk lov krever også at du gir forslag til hvordan feilen kan rettes.</p><hr><h2>Rekkefølge på felter</h2><p>For blinde er det alfa og omega at navnet på input feltet er markert før selve inputfeltet, slik at de vet hva inputfeltet gjelder. Skal man oppgi navn, velg derfor å presentere &lt;navn&gt; &lt;input&gt; Legger du beskrivelse på hva som skal legges inn i input feltet i input-feltet, vil blinde måtte gjette seg frem til hva som skal stå i feltet, og svaksynte/fargeblinde vil ha utfordringer med å lese hva som forventes.</p><hr><h2>Konstraster</h2><p>Sørg for at det er god kontrast mellom fargen på input feltet og bakgrunnsfargen for nettsiden på skjemaet. Hvis kundens grafiske profil ikke byr på gode nok kontraster, kan du velge å ramme inn inputfeltene. Les mer om kontraster i Farge-kortet. </p><h2>Mellomlagring</h2><p>WCAG AAA krever at skjemaer og steder som krever input fra bruker tilbyr mellomlagring i opp til 30 min. De fleste nettleserer fikser dette av seg selv, men dobbeltsjekk at dine brukere s foretrukne browser tilbyr dette</p>",
    "reference": [{
        "url": "http://uu.difi.no/veiledning/suksesskriterier/333-forslag-ved-feil",
        "title": "Forslag ved feil"
    }, {
        "url": "http://uu.difi.no/veiledning/suksesskriterier/322-inndata",
        "title": "Inndata"
    }],
    "relevant": [{
        "url": "#",
        "title": "yada yada"
    }]
}