{
    "title":"Typografi",
    "category": "design",
    "importance": [0, 2, 0, 0, 1, 0],
    "preface": "God typografi forutsetter et klart hierarki. Teksten blir enklere å scanne, og å forstå hva som er overskrift, ingress, brødtekst og så videre. Som en tommelfingerregel bør du holde deg til tre ulike størrelser på typografi på en visning. Det er også best å holde seg til maks to-tre forskjellige fonter for å unngå et rotete inntrykk.",
    "figure": "/images/Typografi-2x.png",
    "body": "<h2>Lesbarhet</h2>
            <p>Lesbarhet er essensielt for tilgjengelighet. Lange linjer gjør det vanskelig å se raskt gjennom teksten, og for øyet å finne neste linje. Sans serif-fonter har til nå vært mest brukt på brødtekster. Serif-fonter kan ha hårfine “ben” som gjør de mindre lesbare på skjerm. Men stadig bedre skjermer og oppløsning,
            </p>
            <h2>Stammer og linjeavstand</h2>
            <p>Sørg for at stammene på fonten ikke er for tynn. Ved tynne stammer blir tekst fort uklar på skjerm, og vanskeligere å skalere. Selv om fargen har god kontrast, kan likevel fonten være for tynn for god lesbarhet. Riktig linjeavstand er også essensielt for god lesbarhet.
            </p>
            <h2>Størrelser</h2>
            <p>Hvis bruker skal kunne øke og minske tekststørrelsen, må du benytte relative størrelser som rem og em, ikke faste størrelser som piksler. De fleste nettlesere har innebygget funksjonalitet for tekstforstørrelse. Prioriter derfor heller å lære brukeren din om denne funksjonaliteten, i stedet for å bruke tid på å lage funksjonalitet for å øke/minske tekststørrelse.
            </p>",
    "reference": [{
        "url": "http://ilovetypography.com/2008/02/28/a-guide-to-web-typography/",
        "title": "A guide to web typography"
    }, {
        "url": "http://iallenkelhet.no/2009/04/15/7-tips-for-god-typografi-pa-nett/",
        "title": "7 tips for god typografi på nett"
    }, {
        "url": "http://blog.makingwaves.no/design/trendwatch-2013-fokus-pa-typografi/",
        "title": "Trendwatch 2013 fokus pa typografi"
    }, {
        "url": "http://uu.difi.no/veiledning/nettsider/uu-skolen/tekst-og-struktur",
        "title": "Difis uu-skole, tekst og struktur"
    }, {
        "url": "http://uu.difi.no/veiledning/suksesskriterier/131-informasjon-og-relasjoner",
        "title": "Difis suksesskriterier, informasjon-og-relasjoner"
    }],
    "relevant": [{
        "url": "#kort/kontraster",
        "title": "Kontraster"
    }]
}






